BridgeProtocole/src/jbiasa/BridgeProtocole.wsdl

<?xml version="1.0" encoding="UTF-8"?>

<!--
  This file is auto-generated by CASA. 
  Edit its content manually may cause unrecoverable errors.
-->

<definitions xmlns="http://schemas.xmlsoap.org/wsdl/"
             xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/"
             xmlns:xsd="http://www.w3.org/2001/XMLSchema"
             targetNamespace="BridgeProtocole"
             xmlns:tns="BridgeProtocole" xmlns:ns="http://service/" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/">
    <import namespace="http://service/" location="../jbiasa/192.168.43.223_8080/ProviderApp/ServiceService.wsdl"/>
    <portType name="dummyCasaPortType"/>
    <binding name="casaBinding1" type="ns:Service">
        <soap:binding style="document" transport="http://schemas.xmlsoap.org/soap/http"/>
        <operation name="operation">
            <soap:operation/>
            <input>
                <soap:body use="literal"/>
            </input>
            <output>
                <soap:body use="literal"/>
            </output>
        </operation>
    </binding>
    <service name="BridgeProtocoleService1">
        <port name="esbProvider" binding="tns:casaBinding1">
            <soap:address location="http://localhost:${HttpDefaultPort}/BridgeProtocoleService1/esbProvider"/>
        </port>
    </service>
</definitions>

