BridgeProtocole/test/TestCase1/Input.xml

<soapenv:Envelope xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ser="http://service/">
  <soapenv:Body>
    <ser:operation>
      <!--Optional:-->
      <arg0>jjj</arg0>
      <arg1>5</arg1>
      <arg2>3</arg2>
    </ser:operation>
  </soapenv:Body>
</soapenv:Envelope>